In [5]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [6]:
Product = {"id": [1,2],
           "name": ["Latte", "Cake"],
          "price": [10000,20000],
          "id_category": [2,1],
          "id_cashier": [1,2]}

Category = {"id": [1,2],
            "name": ["Food", "Drink"]}

Cashier = {"id": [1,2],
          "name": ["Pevita Pearce", "Raisa Andriana"]}

In [8]:
df_Product = DataFrame(Product, columns=["id", "name", "price", "id_category", "id_cashier"])
df_Product

   id   name  price  id_category  id_cashier
0   1  Latte  10000            2           1
1   2   Cake  20000            1           2

In [9]:
df_Category= DataFrame(Category, columns=["id", "name"])
df_Category

   id   name
0   1   Food
1   2  Drink

In [10]:
df_Cashier = DataFrame(Cashier, columns= ["id", "name"])
df_Cashier

   id            name
0   1   Pevita Pearce
1   2  Raisa Andriana

In [11]:
bayar =df_Cashier.iloc[0,1] #id 1
bayar2 = df_Cashier.iloc[1,1] #id 2

kategori = df_Category.iloc[1,1] #id 1
kategori2 = df_Category.iloc[0,1] #id 2

product = df_Product.iloc[0,1:3] #id 1
product2 = df_Product.iloc[1,1:3] #id 2

In [12]:
print(bayar)
print(bayar2)

Pevita Pearce
Raisa Andriana

In [13]:
print(kategori)
print(kategori2)

Drink
Food

In [14]:
print(product)
print(product2)

name     Latte
price    10000
Name: 0, dtype: object
name      Cake
price    20000
Name: 1, dtype: object

In [15]:
#Grouping
Group = {"cashier": [bayar,bayar2],
         "product": [product[0], product2[0]],
        "category": [kategori, kategori2],
        "price": [product[1], product2[1]]}

In [16]:
df_Final = DataFrame(Group, columns=["cashier", "product","category", "price"])
df_Final

          cashier product category  price
0   Pevita Pearce   Latte    Drink  10000
1  Raisa Andriana    Cake     Food  20000